{
  "tips": [
    {
      "id": "double-click-open",
      "text": "Double-click any bookmark card or table row to open the link in a new tab!",
      "contexts": ["dashboard", "hub", "search"]
    },
    {
      "id": "keyboard-shortcut",
      "text": "Press Alt+A to quickly add a new bookmark from anywhere in the app.",
      "contexts": ["dashboard", "hub", "search"]
    },
    {
      "id": "tag-search",
      "text": "Click on any tag to instantly search for all bookmarks with that tag.",
      "contexts": ["dashboard", "hub"]
    },
    {
      "id": "bulk-operations",
      "text": "In table view, use checkboxes to select multiple bookmarks for bulk deletion.",
      "contexts": ["dashboard", "hub"]
    },
    {
      "id": "smart-collections",
      "text": "The Smart Hub automatically groups related bookmarks using AI - check it out!",
      "contexts": ["dashboard"]
    },
    {
      "id": "forgotten-bookmarks",
      "text": "Visit the Smart Hub to rediscover bookmarks you haven't used in a while.",
      "contexts": ["dashboard"]
    },
    {
      "id": "clipboard-detection",
      "text": "When adding bookmarks, URLs in your clipboard are automatically detected and filled in.",
      "contexts": ["dashboard", "hub"]
    },
    {
      "id": "import-bookmarks",
      "text": "You can import bookmarks from Firefox, Chrome, or Edge using HTML export files in your profile settings.",
      "contexts": ["dashboard", "profile"]
    },
    {
      "id": "compact-mode",
      "text": "Toggle compact mode to fit more bookmarks on your screen at once.",
      "contexts": ["dashboard", "hub"]
    },
    {
      "id": "favorites-filter",
      "text": "Use the favorites filter to quickly find your most important bookmarks.",
      "contexts": ["dashboard"]
    },
    {
      "id": "auto-title-extraction",
      "text": "When adding bookmarks, titles are automatically extracted from the webpage for convenience.",
      "contexts": ["dashboard", "hub"]
    },
    {
      "id": "tag-management",
      "text": "Visit the tag management page to rename or delete tags across all your bookmarks.",
      "contexts": ["profile"]
    },
    {
      "id": "search-everything",
      "text": "The search function looks through titles, URLs, descriptions, and tags to find what you need.",
      "contexts": ["search"]
    },
    {
      "id": "collection-saving",
      "text": "Save your search results as a smart collection for easy access later.",
      "contexts": ["search"]
    },
    {
      "id": "random-bookmark",
      "text": "Check out the random bookmark section in Smart Hub to rediscover forgotten gems.",
      "contexts": ["hub"]
    },
    {
      "id": "dark-mode",
      "text": "Toggle dark mode in your profile settings for comfortable viewing in low light.",
      "contexts": ["profile"]
    },
    {
      "id": "pagination-control",
      "text": "Adjust how many bookmarks are shown per page, or view all at once using the pagination controls.",
      "contexts": ["dashboard", "hub"]
    },
    {
      "id": "view-modes",
      "text": "Switch between grid and table view to find the layout that works best for you.",
      "contexts": ["dashboard", "hub"]
    }
  ]
}